package students.aleksandra_hodjuka.lesson_9.level_3;

abstract class AbstractClass {
    /*
    Что такое абстрактный класс?

     Абстрактный класс в Java - это класс, который может содержать как обычные методы с реализацией,
     так и абстрактные методы без реализации, предоставляя основу для создания других классов,
     но сам не может быть использован для создания объектов.


    Можно ли создать экземпляр абстрактного класса в момент выполнения программы?

    Нельзя создать экземпляр абстрактного класса в момент выполнения программы, поскольку
    абстрактный класс создан для предоставления общего интерфейса и реализации для его подклассов,
    но сам по себе не представляет конкретной реализации.
*/
}
