package students.aleksandra_hodjuka.lesson_2.level_5;

public class Task_15 {
    public static void main(String[] args) {


        System.out.println("Напишите программу, которая демонстрирует использование команды!");




    }





}
